elastic-tube-3d-absolute/fluid-openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    auto0
    {
        type            zeroGradient;
    }
    interface
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    auto2
    {
        type            zeroGradient;
    }
}
