elastic-tube-3d-absolute/fluid-openfoam/constant/dynamicMeshDict
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          motionProperties;
}

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ( "libfvMotionSolvers.so" );

solver          displacementLaplacian;
// OpenFOAM9 or newer: rename "solver" to "motionSolver"

displacementLaplacianCoeffs
{
	diffusivity	quadratic inverseDistance (interface); ;
}

frozenDiffusion     yes;
distancePatches
(
    interface
); 
