elastic-tube-3d-absolute/fluid-openfoam/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

nu              nu [0 2 -1 0 0 0 0] 3e-6;

transportModel  Newtonian;
