elastic-tube-3d-absolute/fluid-openfoam/system/fvSchemes
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object fvSchemes;
}

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default Gauss linear;
    grad(U) leastSquares;
    grad(nuTilda) cellLimited Gauss linear 1;
    grad(k) cellLimited Gauss linear 1;
    grad(kl) cellLimited Gauss linear 1;
    grad(omega) cellLimited Gauss linear 1;
    grad(epsilon) cellLimited Gauss linear 1;
    grad(q) cellLimited Gauss linear 1;
    grad(zeta) cellLimited Gauss linear 1;
    grad(v2) cellLimited Gauss linear 1;
    grad(f) cellLimited Gauss linear 1;
    grad(sqrt(kt)) cellLimited Gauss linear 1;
    grad(kt) cellLimited Gauss linear 1;
    grad(sqrt(kl)) cellLimited Gauss linear 1;
}

divSchemes
{
    default Gauss linear;
    div(phi,U) Gauss linearUpwindV leastSquares;
    div(phi,k)  Gauss linearUpwind cellLimited Gauss linear 1;
    div(phi,epsilon) bounded Gauss linearUpwind grad(epsilon);
    div(phi,zeta) bounded Gauss linearUpwind grad(zeta);
    div(phi,q) bounded Gauss linearUpwind grad(q);
    div(phi,omega) bounded Gauss linearUpwind grad(omega);
    div(phi,nuTilda) bounded Gauss linearUpwind grad(nuTilda);
    div(phi,T) bounded Gauss limitedLinear 1;
    div(phi,kl) Gauss limitedLinear 1;
    div(phi,kt) Gauss limitedLinear 1;
    div(phi,R) Gauss upwind;
    div(R) Gauss linear;
    div((nuEff*dev(grad(U).T()))) Gauss linear;
    div(phi,v2) bounded Gauss linearUpwind grad(v2);
    div(phi,f) bounded Gauss linearUpwind grad(f);
}

interpolationSchemes
{
    default linear;
    interpolate(HbyA) linear;
}

laplacianSchemes
{
    default Gauss linear limited 0.333;
}

snGradSchemes
{
    default limited 0.333;
}

wallDist
{
    method meshWave;
}

fluxRequired
{
    default yes;
    p ;
}
